#Напишите программу, которая принимает на вход два числа и
#проверяет, является ли одно число квадратом другого.

print('input а')
a = float(input())
b = int(a*10)
print(b % 10)

#b = a.split(',')
#print(b)
#c = []
#for tmp in b:
#    c.append(int(tmp))
#print(max(c))
#print('input b')
#b = int(input())
#result = 'no'
#if a == b**2 or b == a**2:
#    result = 'yes'
#print(result)




#max_number = float('-inf')
#for i in range(1, 6):
#    number = int(input(f'Введите число {i}: '))
#    if number > max_number:
#        max_number = number

#print(max_number)
